export class minibus {
    constructor(bus_id,is_rec = false) {
        this.indexStopOver = 0;
        this.is_recursive = is_rec;
        this.is_breaking = false;
        this.breaking_in_min = 0;
        this.is_sleeping = false;
        this.PassengersIndexes = [];
        this.max_passengers = 20;
        this.sizeOfPath = 0;
        this.bus_id = bus_id;
        switch (bus_id) {
            case 1:
                this.path = [
              "ОАО «Брестский мясокомбинат»","ОАО «Агротранс»","ул.Смирнова","ул.Речицкая","ул.Адамковская","ул.Южная","ул.Веселая","ул.Брестских Дивизий",
              "ул.Ленина","ул.Мицкевича","ул.Комсомольская","пр-т Машерова","б-р Шевченко","ул.Махновича","ул.Мытная","ул.Грибоедова",
              "Варшавское шоссе","Женский монастырь","ул.Ковельская","ул.Свято-Афанасьевская","ул.Кирпичная","Ковельское шоссе","ул.Жукова","ул.Защитников Отечества","ул.Гвардейская",
              "ул.Рокосовского","ул.Жукова","ул.Суворова","ул.Волгоградская","ул.Луцкая","ул.28 Июля","ул.Московская","ул.Советской Конституции","ул.Ленинградская","ул.Гродненская",
               "ул.Лактионова","ЦГБ"];
                this.path_rec = [
              "ОАО «Брестский мясокомбинат»","ОАО «Агротранс»","ул.Смирнова","ул.Речицкая","ул.Адамковская","ул.Южная","ул.Веселая","ул.Брестских Дивизий","ул.Ленина","ул.Мицкевича",
              "ул.Комсомольская","ул.Ленина","пр-т Машерова","б-р Шевченко","ул.Махновича","ул.Мытная","ул.Грибоедова",
              "Варшавское шоссе","Женский монастырь","ул.Ковельская","ул.Свято-Афанасьевская","ул.Кирпичная","Ковельское шоссе","ул.Жукова","ул.Защитников Отечества","ул.Гвардейская",
              "ул.Рокосовского","ул.Жукова","ул.Суворова","ул.Волгоградская",
              "ул.Луцкая","ул.28 Июля","ул.Московская","ул.Советской Конституции","ул.Ленинградская","ул.Гродненская","ул.Лактионова","ЦГБ"]
                .reverse();
                this.timestart = 6*60 + 16;
                this.timeend = 21*60 + 30;
                break;
            case 2:
                this.path = ["д.Бернады","ул.Учительская","ул.Кирпичная","ул.Жукова","ул.Сябровская","ул.Рябиновая",
              "ул.Вульковская","ул.Колесника","ул.Сальникова","ул.Махновича","б-р Шевченко","б-р Космонавтов",
              "ул.Пушкинская","ул.Пионерская","ул.Мошенского","ВамРад"];
                this.path_rec = [...this.path].reverse();
                this.timestart = 6*60 + 48;
                this.timeend = 21*60 + 10;
                break;
            case 5:
                this.path = ["ул.Клейниковская","ул.Смирнова","Брест-Западный","ул.Героев Обороны Брестской крепости (ГОБК)","ул.Ленина","ул.Мицкевича","ул.Комсомольская",
              "ул.Пушкинская","ул.Пионерская","ул.Я.Купалы","Партизанский пр-т","ул.Московская","ул.Стафеева","ул.Лактионова","ЦГБ"];
                this.path_rec = ["ул.Клейниковская",
              "ул.Смирнова",
              "Брест-Западный",
              "ул.Героев Обороны Брестской крепости (ГОБК)",
              "ул.Орджоникидзе",
              "ул.К.Маркса",
              "ул.Мицкевича",
              "б-р Космонавтов",
              "ул.Пушкинская",
              "ул.Пионерская",
              "ул.Я.Купалы",
              "Партизанский пр-т",
              "ул.Московская",
              "ул.Стафеева",
              "ул.Лактионова",
              "ЦГБ"]
                .reverse();
                this.timestart = 6*60 + 25;
                this.timeend = 21*60 + 0;
                break;
            case 6:
                this.path = ["ВамРад",
               "ул.Старозадворская","ул.Автолюбителей","ул.Мошенского","ул.Шоссейная","ул.Фортечная","ул.Кижеватова",
               "пригородный ж/д вокзал","ул.Спортивная","ул.Республиканская","ул.Брестских Дивизий","ул.Ленина","пр-т Машерова",
               "ул.Московская","Областная больница","Тельмы","д.Косичи"];
                this.path_rec = ["ВамРад",
               "ул.Старозадворская","ул.Автолюбителей","ул.Мошенского","ул.Шоссейная","ул.Фортечная",
               "ул.Кижеватова","пригородный ж/д вокзал","ул.Ленина","пр-т Машерова","ул.Московская",
               "Областная больница","Тельмы","д.Косичи"].reverse();
                this.timestart = 6*60 + 45;
                this.timeend = 21*60 + 0;
                break;
            case 7:
                this.path = ["д.Курница",
               "д.Косичи","д.Черни","ул.Городская","кладбище Плоска","ул.Красногвардейская","ул.Республиканская",
               "ул.Ленина","ул.Мицкевича","ул.Комсомольская","ул.17 Сентября","пр-т Машерова","ул.Московская","ул.Пионерская","ул.Я.Купалы","Партизанский пр-т","пр-т Республики",
               "ул.Суворова","ул.Волгоградская","ул.Луцкая","ул.28 Июля","ул.Суворова","ул.Сябровская","ул.Рябиновая","ул.Вульковская",
               "ул.Колесника","л. Морозова","ул.Краснознаменная","ул.Екельчика","ул.Грюнвальдская","ул.Махновича","ул.Мытная",
               "ул.Грибоедова","ул.Сальникова","ТРЦ Варшавский"];
                this.path_rec = ["д.Курница","д.Косичи",
               "д.Черни","ул.Городская","кладбище Плоска","ул.Красногвардейская","ул.Спортивная","ул.Кижеватова","ул.Ленина","ул.Мицкевича","б-р Космонавтов",
               "ул.Комсомольская","ул.17 Сентября","пр-т Машерова","ул.Московская","ул.Пионерская","ул.Я.Купалы","Партизанский пр-т","пр-т Республики","ул.Суворова",
               "ул.Волгоградская","ул.Луцкая","ул.28 Июля","ул.Суворова","ул.Сябровская","ул.Рябиновая","ул.Вульковская","ул.Колесника","л. Морозова",
               "ул.Краснознаменная","ул.Екельчика","ул.Грюнвальдская","ул.Махновича","ул.Мытная","ул.Грибоедова","ул.Сальникова","ТРЦ Варшавский",].reverse();
                this.timestart = 6*60 + 18;
                this.timeend = 21*60 + 0;
                break;
            case 9:
                this.path = [
               "ОАО «Брестский мясокомбинат»","ОАО «Агротранс»","ул.Смирнова","ул.Речицкая","ул.Адамковская","ул.Южная",
               "ул.Веселая","ул.Брестских Дивизий","ул.Ленина","пр-т Машерова","ул.Московская","Партизанский пр-т","ул.Ленинградская",
               "ул.Гаврилова","ул.Орловская","ул.Гродненская","ул.Ленинградская"];
                this.path_rec = [...this.path].reverse();
                this.timestart = 6*60 + 2;
                this.timeend = 21*60 + 7;
                
                break;
            case 10:
                this.path = 
                ["Брест-Западный",
               "ул.Героев Обороны Брестской крепости (ГОБК)",
               "Брестская крепость",
               "ул.Ленина",
               "пр-т Машерова",
               "ул.Московская",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "пр-т Республики",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Ленинградская",
               "ул.Коммерческая",
               "ул.Мошенского",
               "ул.Шоссейная",
               "ул.Фортечная",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Республиканская",
               "Центральный ж/д вокзал"];
                this.path_rec = 
                ["Брест-Западный",
               "ул.Героев Обороны Брестской крепости (ГОБК)",
               "ул.Зубачева",
               "ул.Гоголя",
               "ул.Ленина",
               "пр-т Машерова",
               "ул.Московская",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "пр-т Республики",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Ленинградская",
               "ул.Коммерческая",
               "ул.Мошенского",
               "ул.Шоссейная",
               "ул.Фортечная",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Республиканская",
               "Центральный ж/д вокзал"].reverse();
                this.timestart = 6*60 + 20;
                this.timeend = 20*60 + 35;
                
                break;
            case 12:
                this.path = ["ул.Адамковская",
               "ул.Пригородная",
               "ул.Смирнова",
               "ул.Речицкая",
               "ул.Адамковская",
               "ул.Южная",
               "ул.Веселая",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "ул.Советская",
               "ул.Орджоникидзе",
               "б-р Космонавтов",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Бориса Маслова",
               "ул.Сябровская",
               "ул.Суворова",
               "ул.Луцкая",
               "ул.28 Июля",
               "ул.Пионерская",
               "ул.Я.Купалы",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Гродненская",
               "ул.Ленинградская",
               "ул.Коммерческая",
               "гост. «Дружба»"];
                this.path_rec = ["ул.Адамковская",
               "ул.Пригородная",
               "ул.Смирнова",
               "ул.Речицкая",
               "ул.Адамковская",
               "ул.Южная",
               "ул.Веселая",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "б-р Космонавтов",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Бориса Маслова",
               "ул.Сябровская",
               "ул.Суворова",
               "ул.Луцкая",
               "ул.28 Июля",
               "ул.Пионерская",
               "ул.Я.Купалы",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Гродненская",
               "ул.Ленинградская",
               "ул.Коммерческая",
               "гост. «Дружба»"].reverse();
                this.timestart = 6*60 + 5;
                this.timeend = 21*60 + 0;
                
                break;
            case 15:
                this.path = ["«Санта Бремор»",
               "Катин Бор",
               "ул.Дубровская",
               "ул.Юбилейная",
               "ул.Аэродромная",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "пр-т Машерова",
               "ул.Московская",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Стафеева",
               "ул.Лактионова",
               "ЦГБ"];
                this.path_rec = [...this.path].reverse();
                this.timestart =6*60 + 3;
                this.timeend = 21*60 + 30;
                
                break;
            case 17:
                this.path = ["ППВ",
               "ул.Красногвардейская",
               "ул.Республиканская",
               "ул.Ленина",
               "пр-т Машерова",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Сябровская",
               "ул.Жукова",
               "ул.Защитников Отечества",
               "ул.Винника",
               "ул.Дружная",
               "Ковельское шоссе",
               "ул.Томашовская",
               "с/т Заозёрное"];
                this.path_rec = ["ППВ",
               "ул.Красногвардейская",
               "ул.Спортивная",
               "ул.Кижеватова",
               "ул.Ленина",
               "пр-т Машерова",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Сябровская",
               "ул.Жукова",
               "ул.Защитников Отечества",
               "ул.Винника",
               "ул.Дружная",
               "Ковельское шоссе",
               "ул.Томашовская",
               "с/т Заозёрное"].reverse();
                this.timestart = 7*60 + 2;
                this.timeend = 20*60 + 21;
                
                break;
            case 18:
                this.path = ["Центральный ж/д вокзал",
               "ул.Ленина",
               "пр-т Машерова",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Колесника",
               "ул.Вульковская",
               "ул.Рябиновая",
               "ул.Сябровская",
               "ул.Суворова",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "пр-т Республики",
               "Партизанский пр-т",
               "ул.Орловская",
               "ул.Гродненская",
               "ЦГБ"];
                this.path_rec = [...this.path].reverse();
                this.timestart = 6*60 + 42;
                this.timeend = 21*60 + 20;
                
                break;
            case 19:
                this.path = ["Областная больница",
               "ул.Московская",
               "ул.Гаврилова",
               "ул.Ленинградская",
               "Партизанский пр-т",
               "ул.Молодогвардейская",
               "ул.Советской Конституции",
               "ул.Московская",
               "пр-т Республики",
               "ул.Суворова",
               "ул.Волгоградская",
               "ул.Луцкая",
               "ул.28 Июля",
               "ул.Суворова",
               "ул.Сябровская",
               "ул.Бориса Маслова",
               "ул.Краснознаменная",
               "ул.Сальникова",
               "ул.Махновича",
               "б-р Шевченко",
               "пр-т Машерова",
               "ул.К.Маркса",
               "ул.Мицкевича",
               "ул.Ленина",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Красногвардейская",
               "ул.Вересковая",
               "ул.8-я Вересковая"];
                this.path_rec = ["Областная больница",
               "ул.Московская",
               "ул.Гаврилова",
               "ул.Ленинградская",
               "Партизанский пр-т",
               "ул.Молодогвардейская",
               "ул.Советской Конституции",
               "ул.Московская",
               "пр-т Республики",
               "ул.Суворова",
               "ул.Волгоградская",
               "ул.Луцкая",
               "ул.28 Июля",
               "ул.Суворова",
               "ул.Сябровская",
               "ул.Бориса Маслова",
               "ул.Краснознаменная",
               "ул.Сальникова",
               "ул.Махновича",
               "б-р Шевченко",
               "пр-т Машерова",
               "ул.17 Сентября",
               "ул.Комсомольская",
               "ул.Мицкевича",
               "ул.Ленина",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Республиканская",
               "ул.Красногвардейская",
               "ул.Вересковая",
               "ул.8-я Вересковая"].reverse();
                this.timestart = 6*60 + 13;
                this.timeend = 21*60 + 0;
                
                break;
            case 20:
                this.path = ["Областная больница",
               "Вычулки",
               "ул.Гродненская",
               "ул.Ленинградская",
               "ул.Я.Купалы",
               "ул.Пионерская",
               "ул.Войкова",
               "ул.Сикорского",
               "ул.Московская",
               "пр-т Машерова",
               "ул.Ленина",
               "ул.Брестских Дивизий",
               "ул.Дворникова",
               "ул.Акимочкина",
               "ул.Речицкая",
               "ул.Смирнова",
               "д.Клейники",
               "ул.Вишневая",
               "д.Скоки",
               "д.Тюхиничи"];
                this.path_rec = ["Областная больница",
               "Вычулки",
               "ул.Гродненская",
               "ул.Ленинградская",
               "ул.Я.Купалы",
               "ул.Пионерская",
               "ул.Войкова",
               "ул.Фруктовая",
               "ул.Дворцовая",
               "ул.Сикорского",
               "пр-т Машерова",
               "ул.17 Сентября",
               "ул.Комсомольская",
               "ул.Мицкевича",
               "ул.Ленина",
               "ул.Брестских Дивизий",
               "ул.Дворникова",
               "ул.Акимочкина",
               "ул.Речицкая",
               "ул.Смирнова",
               "д.Клейники",
               "ул.Вишневая",
               "д.Скоки",
               "д.Тюхиничи"];
                this.timestart = 6*60 + 5;
                this.timeend = 21*60 + 5;
                
                break;
            case 21:
                this.path = ["д.Козловичи",
               "д.Вистичи",
               "д.Ковердяки",
               "д.Тюхиничи",
               "«Сельхозтехника»",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "ул.Комсомольская",
               "ул.Пушкинская",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.Гаврилова",
               "ул.Ленинградская",
               "ул.Гродненская",
               "ул.Лактионова",
               "ул.Стафеева",
               "ЦГБ"];
                this.path_rec = ["д.Козловичи",
               "д.Вистичи",
               "д.Ковердяки",
               "д.Тюхиничи",
               "«Сельхозтехника»",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.Гаврилова",
               "ул.Ленинградская",
               "ул.Гродненская",
               "ул.Лактионова",
               "ул.Стафеева",
               "ЦГБ"].reverse();
                this.timestart = 6*60 + 20;
                this.timeend =21*60 + 2;
                
                break;
            case 23:
                this.path = ["Детская поликлиника №1",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Республиканская",
               "пригородный ж/д вокзал",
               "ул.Ленина",
               "ул.Мицкевича",
               "ул.Комсомольская",
               "ул.Пушкинская",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "Каменица-Жировецкая"];
                this.path_rec = ["Детская поликлиника №1",
               "ул.Кижеватова",
               "ул.Спортивная",
               "ул.Республиканская",
               "пригородный ж/д вокзал",
               "ул.Ленина",
               "ул.Мицкевича",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "Каменица-Жировецкая"].reverse();
                this.timestart = 6*60 + 20;
                this.timeend = 21*60 + 50;
                
                break;
            case 25:
                this.path = ["«Санта Бремор»",
               "Катин Бор",
               "ул.Дубровская",
               "ул.Белорусская",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "пр-т Машерова",
               "б-р Шевченко",
               "ул.Махновича",
               "ул.Сальникова",
               "ул.Краснознаменная",
               "ул.Сябровская",
               "ул.Суворова",
               "ул.28 Июля",
               "ул.Луцкая",
               "ул.Волгоградская",
               "ул.Суворова",
               "ул.Ясеневая",
               "строительный рынок"];
                this.path_rec = [...this.path].reverse();
                this.timestart = 6*60 + 20;
                this.timeend = 21*60 + 0;
                
                break;
            case 35:
                this.path = ["«Санта Бремор»",
               "Катин Бор",
               "ул.Дубровская",
               "ул.Белорусская",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "ул.Комсомольская",
               "ул.Пушкинская",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.Советской Конституции",
               "ул.Молодогвардейская",
               "Партизанский пр-т",
               "ул.Ленинградская",
               "ул.Гродненская",
               "ул.Московская",
               "Областная больница",
               "ДСУ",
               "ул.Вычулки",
               "ул.Т.Костюшко",
               "ул.Филатова"];
                this.path_rec = ["«Санта Бремор»",
               "Катин Бор",
               "ул.Дубровская",
               "ул.Белорусская",
               "ул.Л-та Рябцева",
               "ул.Брестских Дивизий",
               "ул.Ленина",
               "ул.Мицкевича",
               "б-р Космонавтов",
               "пр-т Машерова",
               "ул.Московская",
               "ул.Советской Конституции",
               "ул.Молодогвардейская",
               "Партизанский пр-т",
               "ул.Ленинградская",
               "ул.Гродненская",
               "ул.Московская",
               "Областная больница",
               "ДСУ",
               "ул.Вычулки",
               "ул.Т.Костюшко",
               "ул.Филатова"].reverse();
                this.timestart = 6*60 + 0;
                this.timeend = 20*60 + 30;
                
                break;
            case "default":
                this.path = [];
                this.path_rec = [];
                this.timestart = [6, 0];
                this.timeend = [21, 0];
                break;
        }
        this.currentPath = is_rec ? this.path_rec : this.path;
        this.sizeOfPath = this.currentPath.length;
    };
};